app/Controllers/Admin/Artikel.php

    public function index()
    {
        $Blog = $this->Blog->findAll();
---
SELECT *
FROM `blog`