app/Controllers/Depan.php

SELECT *
FROM `blog`
---
    public function blog()
    {
        $Blog = $this->Blog->findAll();